 
 
 Процедура ДополнитьФорму(Форма) Экспорт
	 
	 ИмяФормы = Форма.Имяформы;
	 
	 Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда    
		 ВставитьПолеГруппаШапкаПраво(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 ВставитьПолеПередОснованием(Форма);
	 ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 ВставитьПолеПередСуммой(Форма);  
	 ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ВставитьПолеГруппаШапкаПраво(Форма);
	 ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ВставитьПолеГруппаШапкаПраво(Форма);
	 КонецЕсли;
	 
 КонецПроцедуры  
 
 
 Процедура ВставитьПолеГруппаШапкаПраво(Форма)
	  ЭлКонтЛицо = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво,);
	 ЭлКонтЛицо.Вид = ВидПоляФормы.ПолеВвода;
	 ЭлКонтЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";	 
 КонецПроцедуры

 
 Процедура ВставитьПолеПередОснованием(Форма)
	 ЭлКонтЛицо = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),Форма,Форма.Элементы.Основание);
	 ЭлКонтЛицо.Вид = ВидПоляФормы.ПолеВвода;
	 ЭлКонтЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";	 
 КонецПроцедуры
 
  Процедура ВставитьПолеПередСуммой(Форма)
	 ЭлКонтЛицо = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),Форма,Форма.Элементы.СуммаДокумента);
	 ЭлКонтЛицо.Вид = ВидПоляФормы.ПолеВвода;
	 ЭлКонтЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";	 
 КонецПроцедуры